In [66]:
import pandas as pd
import numpy as np
import os

In [67]:
path = r'C:\Users\esgib\Desktop\Alina\Course 4\Instacart Basket Analysis'

In [68]:
df = pd.read_csv(os.path.join(path, '02 Data', 'Original data', 'products.csv'), index_col=False)

In [69]:
df.shape

(49693, 5)

In [70]:
df.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [71]:
df.dtypes

product_id         int64
product_name      object
aisle_id           int64
department_id      int64
prices           float64
dtype: object

In [72]:
#changing data types to avoid memory errors
df['product_id'] = df['product_id'].astype('int32')
df['department_id'] = df['department_id'].astype('int32')

In [73]:
df.dtypes

product_id         int32
product_name      object
aisle_id           int64
department_id      int32
prices           float64
dtype: object

In [74]:
# dropping 'aisle_id' column
df = df.drop(columns = 'aisle_id')

In [75]:
df.head()

,product_id,product_name,department_id,prices
0,1,Chocolate Sandwich Cookies,19,5.8
1,2,All-Seasons Salt,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,1,10.5
4,5,Green Chile Anytime Sauce,13,4.3

In [76]:
##checking for columns which have mixed datatype
for col in df.columns.tolist(): 
    weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1) 
    if len (df[weird]) > 0: print (col)

product_name

In [77]:
df['product_name'].value_counts()

Black House Coffee Roasty Stout Beer                    2
Adore Forever Body Wash                                 2
Gluten Free Organic Peanut Butter & Chocolate Cereal    2
Fiber 4g Gummy Dietary Supplement                       2
Ranger IPA                                              2
                                                       ..
Kosher Dill Mini Pickles                                1
Chili Rice Scooter                                      1
All Natural Chicken Apple Sausage                       1
Quartered Artichoke Hearts                              1
Fresh Foaming Cleanser                                  1
Name: product_name, Length: 49672, dtype: int64

In [78]:
#changing data type of values in column 'product_name'
df['product_name'] = df['product_name'].astype('str')

In [79]:
#checking again for columns which have mixed datatype
for col in df.columns.tolist(): 
    weird = (df[[col]].applymap(type) != df[[col]].iloc[0].apply(type)).any(axis = 1) 
    if len (df[weird]) > 0: print (col)

In [80]:
#checking 'product_id column' for missing values
print(df['product_id'].isnull().sum())
print(df['product_id'].isna().sum())

0
0

In [81]:
#checking 'product_name column' for missing values
print(df['product_name'].isnull().sum())
print(df['product_name'].isna().sum())

0
0

In [82]:
#checking 'department_id' column for missing values
print(df['department_id'].isnull().sum())
print(df['department_id'].isna().sum())

0
0

In [83]:
#checking 'prices' column for missing values
print(df['prices'].isnull().sum())
print(df['prices'].isna().sum())

0
0

In [84]:
#checking for duplicates
df_dup = df[df.duplicated()]

In [85]:
df_dup.head(20)

,product_id,product_name,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,11,4.8
18459,18458,Ranger IPA,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,14,6.8
35495,35491,Adore Forever Body Wash,11,9.9

In [86]:
#creating new dataframe without duplicates
df_no_dub = df.drop_duplicates()

In [87]:
df_no_dub.shape

(49688, 4)

In [88]:
#imporitng orders_producsts_combined.pkl file which will be merged with df_no_dub
ord_prod = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared data', 'Orders_products_combined.pkl'))

In [89]:
ord_prod.head()

,order_id,product_id,add_to_cart_order,reordered,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2,33120,1,1,202279,3,5,9,8.0
1,2,28985,2,1,202279,3,5,9,8.0
2,2,9327,3,0,202279,3,5,9,8.0
3,2,45918,4,1,202279,3,5,9,8.0
4,2,30035,5,0,202279,3,5,9,8.0

In [90]:
ord_prod.shape

(32434489, 9)

In [91]:
df_merged = ord_prod.merge(df_no_dub, on = 'product_id', how = 'left', indicator = True)

In [92]:
df_merged.shape

(32435059, 13)

In [93]:
df_merged.head()

,order_id,product_id,add_to_cart_order,reordered,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_name,department_id,prices,_merge
0,2,33120,1,1,202279,3,5,9,8.0,Organic Egg Whites,16.0,11.3,both
1,2,28985,2,1,202279,3,5,9,8.0,Michigan Organic Kale,4.0,13.4,both
2,2,9327,3,0,202279,3,5,9,8.0,Garlic Powder,13.0,3.6,both
3,2,45918,4,1,202279,3,5,9,8.0,Coconut Butter,13.0,8.4,both
4,2,30035,5,0,202279,3,5,9,8.0,Natural Sweetener,13.0,13.7,both

In [94]:
df_merged['_merge'].value_counts()

both          32433030
left_only         2029
right_only           0
Name: _merge, dtype: int64

In [95]:
#merging orders and product information
df_merged[df_merged['_merge']=='left_only']

,order_id,product_id,add_to_cart_order,reordered,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_name,department_id,prices,_merge
16863,1770,6799,11,1,678,18,3,13,12.0,NaN,NaN,NaN,left_only
32562,3387,6799,26,1,175450,9,1,19,17.0,NaN,NaN,NaN,left_only
66688,7099,6799,1,0,27,63,3,10,1.0,NaN,NaN,NaN,left_only
72827,7754,6799,7,1,1629,20,3,18,10.0,NaN,NaN,NaN,left_only
76643,8153,6799,8,0,56820,2,1,19,30.0,NaN,NaN,NaN,left_only
...,...,...,...,...,...,...,...,...,...,...,...,...,...
32395275,3416959,6799,5,1,200798,29,2,20,8.0,NaN,NaN,NaN,left_only
32396358,3417067,6799,2,1,161107,9,2,17,24.0,NaN,NaN,NaN,left_only
32414881,3418993,6799,7,0,205789,13,6,12,7.0,NaN,NaN,NaN,left_only
32419959,3419520,6799,4,1,108303,18,1,15,1.0,NaN,NaN,NaN,left_only
32427804,3420332,6799,4,1,147613,16,3,10,28.0,NaN,NaN,NaN,left_only

In [96]:
#checking the orders where product_name value is empty
df_merged[df_merged['product_name'].isna() == True]

,order_id,product_id,add_to_cart_order,reordered,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_name,department_id,prices,_merge
16863,1770,6799,11,1,678,18,3,13,12.0,NaN,NaN,NaN,left_only
32562,3387,6799,26,1,175450,9,1,19,17.0,NaN,NaN,NaN,left_only
66688,7099,6799,1,0,27,63,3,10,1.0,NaN,NaN,NaN,left_only
72827,7754,6799,7,1,1629,20,3,18,10.0,NaN,NaN,NaN,left_only
76643,8153,6799,8,0,56820,2,1,19,30.0,NaN,NaN,NaN,left_only
...,...,...,...,...,...,...,...,...,...,...,...,...,...
32395275,3416959,6799,5,1,200798,29,2,20,8.0,NaN,NaN,NaN,left_only
32396358,3417067,6799,2,1,161107,9,2,17,24.0,NaN,NaN,NaN,left_only
32414881,3418993,6799,7,0,205789,13,6,12,7.0,NaN,NaN,NaN,left_only
32419959,3419520,6799,4,1,108303,18,1,15,1.0,NaN,NaN,NaN,left_only
32427804,3420332,6799,4,1,147613,16,3,10,28.0,NaN,NaN,NaN,left_only

In [97]:
#getting rid of the rows which don't have information about product. 
df_merged_clean = df_merged[df_merged['product_name'].isna() == False]

In [98]:
df_merged_clean.shape

(32433030, 13)

In [101]:
#checking for duplicates
df_merged_clean_dup = df_merged_clean[df_merged_clean.duplicated()]

In [102]:
df_merged_clean_dup

Empty DataFrame
Columns: [order_id, product_id, add_to_cart_order, reordered, user_id, order_number, order_dow, order_hour_of_day, days_since_prior_order, product_name, department_id, prices, _merge]
Index: []

Comment: no duplicates found

In [105]:
#getting rid of merge indicator
df_merged_clean = df_merged_clean.drop(columns= ['_merge'])

In [106]:
df_merged_clean.shape

(32433030, 12)

In [107]:
#exporting the results
df_merged_clean.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'Orders_products_merged.pkl'))